# St7SetLoadCaseGravity

Sets the value of the acceleration due to gravity for the specified load case of type lcGravity.

long St7SetLoadCaseGravity(long uID, long CaseNum, double Gravity)

Input Parameters

uID

Strand7 model file ID.

Load and Freedom Cases

CaseNum

Load case number.

Gravity

Acceleration due to gravity.